In [5]:
import pandas

In [7]:
d = pandas.DataFrame([["Andy", 46, "Engineer"], ["Jane", 33, "Nurse"], ["Robert", 21, "Student"], ["Marie", 30, "Student"]])
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [8]:
d

        0   1         2
0    Andy  46  Engineer
1    Jane  33     Nurse
2  Robert  21   Student
3   Marie  30   Student

In [9]:
d = pandas.DataFrame([["Andy", 46, "Engineer"], ["Jane", 33, "Nurse"], ["Robert", 21, "Student"], ["Marie", 30, "Student"]], columns = ["Name", "Age", "Occupation"])

In [10]:
d

     Name  Age Occupation
0    Andy   46   Engineer
1    Jane   33      Nurse
2  Robert   21    Student
3   Marie   30    Student

In [23]:
d = pandas.DataFrame([["Andy", 46, "Engineer"], ["Jane", 33, "Nurse"], ["Robert", 21, "Student"], ["Marie", 30, "Student"]], columns = ["Name", "Age", "Occupation"], index = ["ID1", "ID2", "ID3", "ID4"])

In [12]:
d

       Name  Age Occupation
ID1    Andy   46   Engineer
ID2    Jane   33      Nurse
ID3  Robert   21    Student
ID4   Marie   30    Student

In [14]:
d.Name

ID1      Andy
ID2      Jane
ID3    Robert
ID4     Marie
Name: Name, dtype: object

In [15]:
d.Age

ID1    46
ID2    33
ID3    21
ID4    30
Name: Age, dtype: int64

In [16]:
d.Occupation

ID1    Engineer
ID2       Nurse
ID3     Student
ID4     Student
Name: Occupation, dtype: object

In [17]:
type(d.Age)

pandas.core.series.Series

In [18]:
d.Age.min()

21

In [19]:
d.Age.max()

46

In [20]:
d.Name.min()

'Andy'

In [21]:
d.min()

Name              Andy
Age                 21
Occupation    Engineer
dtype: object